export type VideoList = {
  id: number;
  avatar: string;
  src: string;
  genre: string;
  about: string;
  name: string;
};

export const listVideo: VideoList[] = [
  {
    id: 1,
    avatar: 'https://www.nautiljon.com/images/clip/02/81/halazia_231018.webp?0',
    src: 'https://topvideo.tj/get_file/8/7b0f7d1b7c35fb5889973cc44b5df97f/340000/340594/340594.mp4/?download=true&download_filename=ateez-halazia-official-mv.mp4',
    genre: 'MV',
    about:
      'ATEEZ (кор. 에이티즈; стилизуется как ATEEZ, читается как Эйтиз) — южнокорейский бой-бэнд, сформированный в 2018 году компанией KQ Entertainment. Группа состоит из восьми участников: Хонджун, Сонхва, Юнхо, Ёсан, Сан, Минги,Уён и Чонхо. Группа дебютировала 24 октября 2018 года с мини-альбомом Treasure EP.1: All to Zero.[1][2][3] 2 ноября группа исполнила свою песню «Pirate King» на Music Bank.[4][5]',
    name: 'Ateez - Halazia ',
  },
  {
    id: 2,
    avatar: 'https://thebiaslistcom.files.wordpress.com/2018/02/nct-u-boss.jpg',
    src: 'https://storage.mix.com.tj/download/video/7/72/5fca324fc11c4.mp4',
    genre: 'MV',
    about:
      'NCT ((кор. 엔시티); расшифровывается как Neo Culture Technology) — южнокорейский бойбенд, сформированный в 2016 году компанией S.M. Entertainment[1]. По состоянию на август 2023 года группа состоит из 20 человек и разделена на четыре различных юнита. Главный юнит NCT U дебютировал в апреле 2016 года с двумя синглами «The 7th Sense» и «Without You»[2][3]. Второй юнит NCT 127, основанный в Сеуле, дебютировал 7 июля того же года с мини-альбомом NCT#127. Третий юнит NCT Dream дебютировал в августе с синглом «Chewing Gum».[4] В январе 2019 года дебютировала китайский юнит WayV с сингловым-альбомом The Vision. Второй зарубежный юнит NCT, NCT Hollywood, будет базироваться в Соединенных Штатах и дебютирует позже. Каждый юнит продвигается отдельно, NCT трижды объединялись как группа, и выпустили три полноформатных альбома: Empathy (2018), Resonance (2020) и Universe (2021). В течение двух месяцев после релиза альбом Resonance разошелся тиражом более 2,6 миллиона копий в двух частях, став самым продаваемым физическим альбомом, выпущенным группой SM Entertainment на тот момент, и принес группе их первую награду Grand Daesang на Asia Artist Awards.',
    name: "NCT U - '90's Love",
  },
  {
    id: 3,
    avatar:
      'https://www.infobae.com/new-resizer/v91U0jH3VHxzBgqUEGmVpv3-Y2U=/arc-anglerfish-arc2-prod-infobae/public/OP3VXEFN5ZGXPJQTY3PW63XLI4.png',
    src: 'https://storage.mix.com.tj/download/video/6/16/62bc44df3fa96.mp4',
    genre: 'MV',
    about:
      'BTS (кор. 방탄소년단 Пантхан сонёндан, кит. 防彈少年團 Фандань шаоняньтуань, яп. 防弾少年団; Бо̄дан сё̄нэндан, также известные как Bangtan Boys или Beyond The Scene) — южнокорейский бой-бэнд, сформированный в 2013 году компанией Big Hit Entertainment. Коллектив состоит из семи участников: RM (лидер группы), Чина, Сюги, Джей-Хоупа, Чимина, Ви и Джонгука[1]. В июле 2017 года группа сменила официальный логотип и расшифровку их названия на английском языке, в результате чего они стали Beyond The Scene. BTS получили мировое признание после выпуска второго студийного альбома Wings, который считался самым успешным в их карьере до января 2018 года (рекорд по продажам был побит мини-альбомом Love Yourself: Her, выпущенным в сентябре 2017 года)[2]. Он позволил группе выиграть номинацию «Артист Года» на престижной музыкальной премии Mnet Asian Music Awards[3]. В 2017 году BTS стали одной из ведущих корейских групп на мировой музыкальной арене: они одержали победу в номинации «Лучший артист социальных сетей» на Billboard Music Awards, их мини-альбом Love Yourself: Her достиг 7 места в американском альбомном чарте Billboard 200, что стало наивысшим результатом среди всех корейских артистов, когда-либо попадавших в этот чарт[4]. Синглы «DNA» и «MIC Drop» удостоились золотых сертификаций от RIAA, что также сделало BTS первым корейским артистом в истории, имеющим подобную сертификацию. Многочисленные рекорды позволили группе второй год подряд одерживать победу в номинации «Артист Года» на Mnet Asian Music Awards[5]. С момента дебюта BTS продали более 5 миллионов своих записей по всему миру[6]. В апреле 2020 года BTS стали самыми продаваемыми артистами в истории Южной Кореи[7]. В 2022 году группа BTS объявила о перерыве в карьере, для службы в армии. По заявлениям музыкального лейбла Big Hit Music группа возобновит свою деятельность примерно в 2025 году.',
    name: 'BTS - Yet to come',
  },
  {
    id: 4,
    avatar: 'https://flxt.tmsimg.com/assets/p90599_p_v8_aq.jpg',
    src: 'https://storage.mix.com.tj/download/video/5/76/5fd4bf24513d5.mp4',
    genre: 'fantasy',
    about:
      'Гарри Поттер, Рон и Гермиона возвращаются на четвертый курс школы чародейства и волшебства «Хогвартс». При таинственных обстоятельствах Гарри отобран в число участников опасного соревнования — Турнира Трех Волшебников, однако проблема в том, что все его соперники — намного старше и сильнее. К тому же, знаки указывают на возвращение Лорда Волдеморта. Вскоре Гарри предстоит побороться не только за победу в соревновании, но и, прежде всего, за свою жизнь...',
    name: 'Harry Potter and the Goblet of Fire',
  },
  {
    id: 5,
    avatar:
      'https://static.wikia.nocookie.net/harrypotter/images/f/fb/PS_poster.jpg/revision/latest?cb=20180318153750',
    src: 'https://storage.mix.com.tj/download/video/4/51/5fd150ea42a62.mp4',
    genre: 'fantasy',
    name: "Harry Potter and the Philosopher's Stone",
    about:
      "Harry Potter and the Philosopher's Stone (released in the United States, India, and the Philippines as Harry Potter and the Sorcerer's Stone) is a 2001 fantasy film directed by Chris Columbus and produced by David Heyman, from a screenplay by Steve Kloves, based on the 1997 novel of the same name by J. K. Rowling. It is the first instalment in the Harry Potter film series. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. Its story follows Harry's first year at Hogwarts School of Witchcraft and Wizardry as he discovers that he is a famous wizard and begins his formal wizarding education.",
  },
  {
    id: 6,
    avatar: 'https://www.nautiljon.com/images/clip/02/81/halazia_231018.webp?0',
    src: 'https://topvideo.tj/get_file/8/7b0f7d1b7c35fb5889973cc44b5df97f/340000/340594/340594.mp4/?download=true&download_filename=ateez-halazia-official-mv.mp4',
    genre: 'MV',
    about:
      'ATEEZ (кор. 에이티즈; стилизуется как ATEEZ, читается как Эйтиз) — южнокорейский бой-бэнд, сформированный в 2018 году компанией KQ Entertainment. Группа состоит из восьми участников: Хонджун, Сонхва, Юнхо, Ёсан, Сан, Минги,Уён и Чонхо. Группа дебютировала 24 октября 2018 года с мини-альбомом Treasure EP.1: All to Zero.[1][2][3] 2 ноября группа исполнила свою песню «Pirate King» на Music Bank.[4][5]',
    name: 'Ateez - Halazia ',
  },
  {
    id: 7,
    avatar: 'https://thebiaslistcom.files.wordpress.com/2018/02/nct-u-boss.jpg',
    src: 'https://storage.mix.com.tj/download/video/7/72/5fca324fc11c4.mp4',
    genre: 'MV',
    about:
      'NCT ((кор. 엔시티); расшифровывается как Neo Culture Technology) — южнокорейский бойбенд, сформированный в 2016 году компанией S.M. Entertainment[1]. По состоянию на август 2023 года группа состоит из 20 человек и разделена на четыре различных юнита. Главный юнит NCT U дебютировал в апреле 2016 года с двумя синглами «The 7th Sense» и «Without You»[2][3]. Второй юнит NCT 127, основанный в Сеуле, дебютировал 7 июля того же года с мини-альбомом NCT#127. Третий юнит NCT Dream дебютировал в августе с синглом «Chewing Gum».[4] В январе 2019 года дебютировала китайский юнит WayV с сингловым-альбомом The Vision. Второй зарубежный юнит NCT, NCT Hollywood, будет базироваться в Соединенных Штатах и дебютирует позже. Каждый юнит продвигается отдельно, NCT трижды объединялись как группа, и выпустили три полноформатных альбома: Empathy (2018), Resonance (2020) и Universe (2021). В течение двух месяцев после релиза альбом Resonance разошелся тиражом более 2,6 миллиона копий в двух частях, став самым продаваемым физическим альбомом, выпущенным группой SM Entertainment на тот момент, и принес группе их первую награду Grand Daesang на Asia Artist Awards.',
    name: "NCT U - '90's Love",
  },
  {
    id: 8,
    avatar:
      'https://www.infobae.com/new-resizer/v91U0jH3VHxzBgqUEGmVpv3-Y2U=/arc-anglerfish-arc2-prod-infobae/public/OP3VXEFN5ZGXPJQTY3PW63XLI4.png',
    src: 'https://storage.mix.com.tj/download/video/6/16/62bc44df3fa96.mp4',
    genre: 'MV',
    about:
      'BTS (кор. 방탄소년단 Пантхан сонёндан, кит. 防彈少年團 Фандань шаоняньтуань, яп. 防弾少年団; Бо̄дан сё̄нэндан, также известные как Bangtan Boys или Beyond The Scene) — южнокорейский бой-бэнд, сформированный в 2013 году компанией Big Hit Entertainment. Коллектив состоит из семи участников: RM (лидер группы), Чина, Сюги, Джей-Хоупа, Чимина, Ви и Джонгука[1]. В июле 2017 года группа сменила официальный логотип и расшифровку их названия на английском языке, в результате чего они стали Beyond The Scene. BTS получили мировое признание после выпуска второго студийного альбома Wings, который считался самым успешным в их карьере до января 2018 года (рекорд по продажам был побит мини-альбомом Love Yourself: Her, выпущенным в сентябре 2017 года)[2]. Он позволил группе выиграть номинацию «Артист Года» на престижной музыкальной премии Mnet Asian Music Awards[3]. В 2017 году BTS стали одной из ведущих корейских групп на мировой музыкальной арене: они одержали победу в номинации «Лучший артист социальных сетей» на Billboard Music Awards, их мини-альбом Love Yourself: Her достиг 7 места в американском альбомном чарте Billboard 200, что стало наивысшим результатом среди всех корейских артистов, когда-либо попадавших в этот чарт[4]. Синглы «DNA» и «MIC Drop» удостоились золотых сертификаций от RIAA, что также сделало BTS первым корейским артистом в истории, имеющим подобную сертификацию. Многочисленные рекорды позволили группе второй год подряд одерживать победу в номинации «Артист Года» на Mnet Asian Music Awards[5]. С момента дебюта BTS продали более 5 миллионов своих записей по всему миру[6]. В апреле 2020 года BTS стали самыми продаваемыми артистами в истории Южной Кореи[7]. В 2022 году группа BTS объявила о перерыве в карьере, для службы в армии. По заявлениям музыкального лейбла Big Hit Music группа возобновит свою деятельность примерно в 2025 году.',
    name: 'BTS - Yet to come',
  },
  {
    id: 9,
    avatar: 'https://flxt.tmsimg.com/assets/p90599_p_v8_aq.jpg',
    src: 'https://storage.mix.com.tj/download/video/5/76/5fd4bf24513d5.mp4',
    genre: 'fantasy',
    about:
      'Гарри Поттер, Рон и Гермиона возвращаются на четвертый курс школы чародейства и волшебства «Хогвартс». При таинственных обстоятельствах Гарри отобран в число участников опасного соревнования — Турнира Трех Волшебников, однако проблема в том, что все его соперники — намного старше и сильнее. К тому же, знаки указывают на возвращение Лорда Волдеморта. Вскоре Гарри предстоит побороться не только за победу в соревновании, но и, прежде всего, за свою жизнь...',
    name: 'Harry Potter and the Goblet of Fire',
  },
  {
    id: 10,
    avatar: 'https://thebiaslistcom.files.wordpress.com/2018/02/nct-u-boss.jpg',
    src: 'https://storage.mix.com.tj/download/video/7/72/5fca324fc11c4.mp4',
    genre: 'MV',
    about:
      'NCT ((кор. 엔시티); расшифровывается как Neo Culture Technology) — южнокорейский бойбенд, сформированный в 2016 году компанией S.M. Entertainment[1]. По состоянию на август 2023 года группа состоит из 20 человек и разделена на четыре различных юнита. Главный юнит NCT U дебютировал в апреле 2016 года с двумя синглами «The 7th Sense» и «Without You»[2][3]. Второй юнит NCT 127, основанный в Сеуле, дебютировал 7 июля того же года с мини-альбомом NCT#127. Третий юнит NCT Dream дебютировал в августе с синглом «Chewing Gum».[4] В январе 2019 года дебютировала китайский юнит WayV с сингловым-альбомом The Vision. Второй зарубежный юнит NCT, NCT Hollywood, будет базироваться в Соединенных Штатах и дебютирует позже. Каждый юнит продвигается отдельно, NCT трижды объединялись как группа, и выпустили три полноформатных альбома: Empathy (2018), Resonance (2020) и Universe (2021). В течение двух месяцев после релиза альбом Resonance разошелся тиражом более 2,6 миллиона копий в двух частях, став самым продаваемым физическим альбомом, выпущенным группой SM Entertainment на тот момент, и принес группе их первую награду Grand Daesang на Asia Artist Awards.',
    name: "NCT U - '90's Love",
  },
  {
    id: 11,
    avatar:
      'https://www.infobae.com/new-resizer/v91U0jH3VHxzBgqUEGmVpv3-Y2U=/arc-anglerfish-arc2-prod-infobae/public/OP3VXEFN5ZGXPJQTY3PW63XLI4.png',
    src: 'https://storage.mix.com.tj/download/video/6/16/62bc44df3fa96.mp4',
    genre: 'MV',
    about:
      'BTS (кор. 방탄소년단 Пантхан сонёндан, кит. 防彈少年團 Фандань шаоняньтуань, яп. 防弾少年団; Бо̄дан сё̄нэндан, также известные как Bangtan Boys или Beyond The Scene) — южнокорейский бой-бэнд, сформированный в 2013 году компанией Big Hit Entertainment. Коллектив состоит из семи участников: RM (лидер группы), Чина, Сюги, Джей-Хоупа, Чимина, Ви и Джонгука[1]. В июле 2017 года группа сменила официальный логотип и расшифровку их названия на английском языке, в результате чего они стали Beyond The Scene. BTS получили мировое признание после выпуска второго студийного альбома Wings, который считался самым успешным в их карьере до января 2018 года (рекорд по продажам был побит мини-альбомом Love Yourself: Her, выпущенным в сентябре 2017 года)[2]. Он позволил группе выиграть номинацию «Артист Года» на престижной музыкальной премии Mnet Asian Music Awards[3]. В 2017 году BTS стали одной из ведущих корейских групп на мировой музыкальной арене: они одержали победу в номинации «Лучший артист социальных сетей» на Billboard Music Awards, их мини-альбом Love Yourself: Her достиг 7 места в американском альбомном чарте Billboard 200, что стало наивысшим результатом среди всех корейских артистов, когда-либо попадавших в этот чарт[4]. Синглы «DNA» и «MIC Drop» удостоились золотых сертификаций от RIAA, что также сделало BTS первым корейским артистом в истории, имеющим подобную сертификацию. Многочисленные рекорды позволили группе второй год подряд одерживать победу в номинации «Артист Года» на Mnet Asian Music Awards[5]. С момента дебюта BTS продали более 5 миллионов своих записей по всему миру[6]. В апреле 2020 года BTS стали самыми продаваемыми артистами в истории Южной Кореи[7]. В 2022 году группа BTS объявила о перерыве в карьере, для службы в армии. По заявлениям музыкального лейбла Big Hit Music группа возобновит свою деятельность примерно в 2025 году.',
    name: 'BTS - Yet to come',
  },
  {
    id: 12,
    avatar: 'https://flxt.tmsimg.com/assets/p90599_p_v8_aq.jpg',
    src: 'https://storage.mix.com.tj/download/video/5/76/5fd4bf24513d5.mp4',
    genre: 'fantasy',
    about:
      'Гарри Поттер, Рон и Гермиона возвращаются на четвертый курс школы чародейства и волшебства «Хогвартс». При таинственных обстоятельствах Гарри отобран в число участников опасного соревнования — Турнира Трех Волшебников, однако проблема в том, что все его соперники — намного старше и сильнее. К тому же, знаки указывают на возвращение Лорда Волдеморта. Вскоре Гарри предстоит побороться не только за победу в соревновании, но и, прежде всего, за свою жизнь...',
    name: 'Harry Potter and the Goblet of Fire',
  },
];
